tp_backend/app/controllers/clients_controller.rb

INSERT INTO "clients" ("name", "relationship_start", "address_city", "address_postal_code", "address_street", "address_apt", "activity_type", "info_email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @client = Client.new(client_params)
    if @client.save